# с клавиатуры вводится число N, а затем – N целых чисел.
# Определить, сколько было введено положительных и
# сколько отрицательных чисел (нули не считать!).
N =int(input())
a = 0
b = 0
while True:
    for i in range()
print(a,b)